Revit 2025 API
ViewportRotation Enumeration
 Rotation of the viewport
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ViewportRotation
Public Enumeration ViewportRotation
public enum class ViewportRotation
type ViewportRotation
Members
Member name | Value | Description
None | 0 |  Viewport is not rotated.
Clockwise | 1 |  Viewport is rotated 90 degrees clockwise.
Counterclockwise | 2 |  Viewport is rotated 90 degrees counterclockwise.
See Also
Reference
Autodesk.Revit.DB Namespace